---
title: 类型检查相关
createTime: 2025/04/15 17:44:38
permalink: /Less/5ji8p7v1/
outline: 2
---

## 1、`isnumber` 是否为数字

`isnumber` 函数用于检查一个值是否为数字。返回值为 `true` 或 `false`。

### 语法

```less
isnumber(value);
```

- `value`：要检查的数值或变量。

### 示例

```less
isnumber(#ff0);     // false
isnumber(blue);     // false
isnumber("string"); // false
isnumber(1234);     // true
isnumber(56px);     // true
isnumber(7.8%);     // true
isnumber(keyword);  // false
isnumber(url(...)); // false
```

## 2、`isstring` 是否为字符串

`isstring` 函数用于检查一个值是否为字符串。返回值为 `true` 或 `false`。

### 语法

```less
isstring(value);
```

- `value`：要检查的字符串或变量。

### 示例

```less
isstring(#ff0);     // false
isstring(blue);     // false
isstring("string"); // true
isnumber(1234);     // false
isnumber(56px);     // false
isnumber(7.8%);     // false
isnumber(keyword);  // false
isnumber(url(...)); // false
```

## 3、`iscolor` 是否为颜色

`iscolor` 函数用于检查一个值是否为颜色。返回值为 `true` 或 `false`。

### 语法

```less
iscolor(value);
```

- `value`：要检查的颜色或变量。

### 示例

```less
iscolor(#ff0);     // true
iscolor(blue);     // true
iscolor("string"); // false
iscolor(1234);     // false
iscolor(56px);     // false
iscolor(7.8%);     // false
iscolor(keyword);  // false
iscolor(url(...)); // false
```

## 4、`iskeyword` 是否为关键字

`iskeyword` 函数用于检查一个值是否为关键字。返回值为 `true` 或 `false`。

### 语法

```less
iskeyword(value);
```

- `value`：要检查的关键字或变量。

### 示例

```less
iskeyword(#ff0);     // false
iskeyword(blue);     // false
iskeyword("string"); // false
iskeyword(1234);     // false
iskeyword(56px);     // false
iskeyword(7.8%);     // false
iskeyword(keyword);  // true
iskeyword(url(...)); // false
```

## 5、`isurl` 是否为 URL

`isurl` 函数用于检查一个值是否为 URL。返回值为 `true` 或 `false`。

### 语法

```less
isurl(value);
```

- `value`：要检查的 URL 或变量。

### 示例

```less
isurl(#ff0);     // false
isurl(blue);     // false
isurl("string"); // false
isurl(1234);     // false
isurl(56px);     // false
isurl(7.8%);     // false
isurl(keyword);  // false
isurl(url(...)); // true
```

## 6、`ispixel` 是否为像素

`ispixel` 函数用于检查一个值是否为像素。返回值为 `true` 或 `false`。

### 语法

```less
ispixel(value);
```

- `value`：要检查的像素或变量。

### 示例

```less
ispixel(#ff0);     // false
ispixel(blue);     // false
ispixel("string"); // false
ispixel(1234);     // false
ispixel(56px);     // true
ispixel(7.8%);     // false
ispixel(keyword);  // false
ispixel(url(...)); // false
```

## 7、`isem` 是否为 em

`isem` 函数用于检查一个值是否为 em。返回值为 `true` 或 `false`。

### 语法

```less
isem(value);
```

- `value`：要检查的 em 或变量。

### 示例

```less
isem(#ff0);     // false
isem(blue);     // false
isem("string"); // false
isem(1234);     // false
isem(56px);     // false
isem(7.8em);    // true
isem(keyword);  // false
isem(url(...)); // false
```

## 8、`ispercentage` 是否为百分比

`ispercentage` 函数用于检查一个值是否为百分比。返回值为 `true` 或 `false`。

### 语法

```less
ispercentage(value);
```

- `value`：要检查的百分比或变量。

### 示例

```less
ispercentage(#ff0);     // false
ispercentage(blue);     // false
ispercentage("string"); // false
ispercentage(1234);     // false
ispercentage(56px);     // false
ispercentage(7.8%);     // true
ispercentage(keyword);  // false
ispercentage(url(...)); // false
```

## 9、`isunit` 是否为特定单位

`isunit` 函数用于检查一个值是否为特定的单位。返回值为 `true` 或 `false`。

### 语法

```less
isunit(value, unit);
```

- `value`：要检查的值或变量。
- `unit`：要检查的单位标识符（引号可选）。

### 示例

```less
isunit(11px, px);  // true
isunit(2.2%, px);  // false
isunit(33px, rem); // false
isunit(4rem, rem); // true
isunit(56px, "%"); // false
isunit(7.8%, '%'); // true
isunit(1234, em);  // false
isunit(#ff0, pt);  // false
isunit("mm", mm);  // false
```

## 10、`isruleset` 是否为规则集

`isruleset` 函数用于检查一个值是否为规则集。返回值为 `true` 或 `false`。

### 语法

```less
isruleset(value);
```

- `value`：要检查的变量。

### 示例

```less
@rules: {
    color: red;
}

isruleset(@rules);   // true
isruleset(#ff0);     // false
isruleset(blue);     // false
isruleset("string"); // false
isruleset(1234);     // false
isruleset(56px);     // false
isruleset(7.8%);     // false
isruleset(keyword);  // false
isruleset(url(...)); // false
```

## 11、`isdefined` 是否定义

`isdefined` 函数用于检查一个变量是否定义。返回值为 `true` 或 `false`。

### 语法

```less
isdefined(variable);
```

- `variable`：要检查的变量。

### 示例

```less
@foo: 1;
isdefined(@foo);     // true
isdefined(@bar);     // false
```
